УРВ_файловая/src/Documents/КомментарийПользователя/КомментарийПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КомментарийПользователя</name>
  <basedOn>Document.ЭлектронноеПисьмоВходящее</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоИсходящее</basedOn>
  <basedOn>Document.КомментарийПользователя</basedOn>
  <basedOn>Document.ТелефонныйЗвонок</basedOn>
  <registerRecords>AccumulationRegister.ЗначенияПоказателей</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ПользователиСервисов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВзаимодействиеОснование</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.КомментарийПользователя</types>
    </type>
  </attributes>
  <attributes>
    <name>Витрина</name>
    <type>
      <types>CatalogRef.Витрины</types>
    </type>
  </attributes>
  <attributes>
    <name>Входящий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеАвторИзменения</name>
    <type>
      <types>CatalogRef.ПользователиСервисов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.КомментарийПользователя</types>
      <types>CatalogRef.Пожелания</types>
      <types>DocumentRef.Обращение</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервис</name>
    <type>
      <types>CatalogRef.Сервисы</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Рассмотрено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_РассмотретьПосле</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УРВ_файловая/src/Catalogs/ПользователиСервисов/ПользователиСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПользователиСервисов</name>
  <owners>Catalog.Сервисы</owners>
  <attributes>
    <name>ЧасовойПояс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаEmail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GUIDОБД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Эталон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УРВ_файловая/src/Catalogs/Пожелания/Пожелания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пожелания</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ПользователиСервисов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийРазработчика</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпонентыСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛинияПоддержки</name>
    <type>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеАвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяКарточка</name>
    <type>
      <types>CatalogRef.Пожелания</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаРеализации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделыСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СервисыСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияПожеланий</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаРеализации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбслуживающаяОрганизация</name>
    <type>
      <types>CatalogRef.ОбслуживающиеОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеДатыРеализации</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>Публикуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сервисы</name>
    <attributes>
      <name>Сервис</name>
      <type>
        <types>CatalogRef.Сервисы</types>
      </type>
    </attributes>
    <attributes>
      <name>Витрина</name>
      <type>
        <types>CatalogRef.Витрины</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Компоненты</name>
    <attributes>
      <name>Компонент</name>
      <type>
        <types>CatalogRef.КомпонентыСервиса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Разделы</name>
    <attributes>
      <name>Раздел</name>
      <type>
        <types>CatalogRef.Разделы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнутренняяПереписка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛинияПоддержки</name>
      <type>
        <types>CatalogRef.ЛинииПоддержки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыполненПеренос</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УРВ_файловая/src/WebServices/UsersIdeas_1_0_0_1/Module.bsl
#Область ПрограммныйИнтерфейс
    
Функция ПолучитьПожелания(ФильтрПоГруппе, ФильтрыПоПредмету, ТипСортировки, НомерСтраницы, СтроковыйИдентификаторПользователя, КоличествоПожеланийНаСтранице)
	
	УстановитьПривилегированныйРежим(Истина);
	// Оперделение пользователя
	ИдентификаторПользователя = Новый УникальныйИдентификатор(СтроковыйИдентификаторПользователя);
	Пользователь = Справочники.ПользователиСервисов.ПолучитьСсылку(ИдентификаторПользователя);
	Если Пользователь.ПолучитьОбъект() = Неопределено Тогда 
		ТекстИсключения = НСтр("ru = 'Не найден пользователь по идентификатору'");
		ИмяСобытия = ЦентрИдей.ИмяСобытияДляЖурналаРегистрации();
		ЦентрИдей.ЗаписатьОшибкуВЖурнал(ИмяСобытия, ТекстИсключения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	// Определение списка доступных предметов пользователю
	ДоступныеКомпонентыПожеланий = ЦентрИдей.ДоступныеКомпонентыПожеланий(Пользователь);
	Если ДоступныеКомпонентыПожеланий.Количество() = 0 Тогда 
		ТекстИсключения = НСтр("ru = 'Нет доступных предметов идей'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	// Определение количества пожеланий в списке
	МаксимальноеЧислоВыбранныхПожеланий = ЦентрИдей.МаксимальноеЧислоВыбранныхПожеланий();
	КоличествоПожеланийВВыборке = КоличествоПожеланийНаСтранице*НомерСтраницы + 1; // Плюс один делается, чтобы знать: есть ли еще пожелания после или нет.
	Если КоличествоПожеланийВВыборке > МаксимальноеЧислоВыбранныхПожеланий Тогда 
		КоличествоПожеланийВВыборке = МаксимальноеЧислоВыбранныхПожеланий;
	КонецЕсли;
	
	// Определение фильтров по предмету
	СписокПредметов = ЦентрИдей.ОтфильтрованныеКомпоненты(ДоступныеКомпонентыПожеланий, ФильтрыПоПредмету);
	
	Если ФильтрПоГруппе = "plan" Тогда
		РезультатЗапросов = ЦентрИдей.СписокЗапланированныхКРеализацииПожеланий(Пользователь, СписокПредметов, ТипСортировки, КоличествоПожеланийВВыборке);
	ИначеЕсли ФильтрПоГруппе = "voiting" Тогда 
		РезультатЗапросов = ЦентрИдей.СписокПожеланийНаГолосовании(Пользователь, СписокПредметов, ТипСортировки, КоличествоПожеланийВВыборке);
	ИначеЕсли ФильтрПоГруппе = "deviation" Тогда
		РезультатЗапросов = ЦентрИдей.СписокОтклоненныхПожеланий(Пользователь, СписокПредметов, ТипСортировки, КоличествоПожеланийВВыборке);
	ИначеЕсли ФильтрПоГруппе = "realization" Тогда
		РезультатЗапросов = ЦентрИдей.СписокРеализованныхПожеланий(Пользователь, СписокПредметов, ТипСортировки, КоличествоПожеланийВВыборке);
	ИначеЕсли ФильтрПоГруппе = "favorites" Тогда 
		РезультатЗапросов = ЦентрИдей.СписокИзбранныхПожеланий(Пользователь, СписокПредметов, ТипСортировки, КоличествоПожеланийВВыборке);
	Иначе
		ТекстИсключения = НСтр("ru = 'Не определен фильтр по статусам идей'");
		ИмяСобытия = ЦентрИдей.ИмяСобытияДляЖурналаРегистрации();
		ЦентрИдей.ЗаписатьОшибкуВЖурнал(ИмяСобытия, ТекстИсключения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	КоличествоЗапросов = РезультатЗапросов.Количество();
	
	////////////////////////////////////////////////////////////////////////////////
	// Заполнение выходных данных
	ТипКонтейнераСписка = ФабрикаXDTO.Тип(ЦентрИдей.ПространствоИмен_1_0_0_1(), "IdeaListPresentation");
	КонтейнерСписка = ФабрикаXDTO.Создать(ТипКонтейнераСписка);
	
	// Заполнение списка пожеланий по пользователю
	Пожелания = РезультатЗапросов.Получить(КоличествоЗапросов - 1).Выгрузить();
	НачальныйЭлемент = НомерСтраницы * КоличествоПожеланийНаСтранице - КоличествоПожеланийНаСтранице;
	Итерация = 0;
	Для Каждого Пожелание Из Пожелания Цикл 
		Если Итерация < НачальныйЭлемент Тогда 
			Итерация = Итерация + 1;
			Продолжить;
		КонецЕсли;
		ПожеланиеXDTO = ПожеланиеXDTO(Пожелание);
		КонтейнерСписка.IdeasList.Добавить(ПожеланиеXDTO);
		Итерация = Итерация + 1;
	КонецЦикла;
	
	// Заполнение количества пожеланий всего
	НомерЗапроса = КоличествоЗапросов - 4;
	Если РезультатЗапросов.Получить(НомерЗапроса).Пустой() Тогда 
		КонтейнерСписка.IdeasCount = 0;
	Иначе
		КонтейнерСписка.IdeasCount = РезультатЗапросов.Получить(НомерЗапроса).Выгрузить().Получить(0).КоличествоПожеланий;
	КонецЕсли;
	
	// Заполнение доступных предметов
	Для Каждого ДоступныйПредмет Из ДоступныеКомпонентыПожеланий Цикл 
		КонтейнерСписка.SubjectsList.Добавить(ДоступныйПредмет.Наименование);
	КонецЦикла;
	
	Возврат КонтейнерСписка;
	
КонецФункции

Функция ПолучитьПожелание(СтроковыйИдентификаторПожелания, СтроковыйИдентификаторПользователя, НомерСтраницыКомментариев, КоличествоКомментариевНаСтранице)
	
	УстановитьПривилегированныйРежим(Истина);
	// Оперделение пользователя
	ИдентификаторПользователя = Новый УникальныйИдентификатор(СтроковыйИдентификаторПользователя);
	Пользователь = Справочники.ПользователиСервисов.ПолучитьСсылку(ИдентификаторПользователя);
	Если Пользователь.ПолучитьОбъект() = Неопределено Тогда 
		ТекстИсключения = НСтр("ru = 'Не найден пользователь по идентификатору'");
		ИмяСобытия = ЦентрИдей.ИмяСобытияДляЖурналаРегистрации();
		ЦентрИдей.ЗаписатьОшибкуВЖурнал(ИмяСобытия, ТекстИсключения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	// Получение пожелания
	ИдентификаторПожелания = Новый УникальныйИдентификатор(СтроковыйИдентификаторПожелания);
	Пожелание = Справочники.Пожелания.ПолучитьСсылку(ИдентификаторПожелания);
	Если Пожелание.Пустая() Тогда 
		ТекстИсключения = НСтр("ru = 'Не найдена Пожелание пользователя'");
		ИмяСобытия = ЦентрИдей.ИмяСобытияДляЖурналаРегистрации();
		ЦентрИдей.ЗаписатьОшибкуВЖурнал(ИмяСобытия, ТекстИсключения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////
	// Заполнение выходных данных
	ТипПредставленияПожелания = ФабрикаXDTO.Тип(ЦентрИдей.ПространствоИмен_1_0_0_1(), "IdeaPresentation");
	ПредставлениеПожелания = ФабрикаXDTO.Создать(ТипПредставленияПожелания);
	
	// Заполнение пожелания 
	РезультатЗапросовПоПожеланием = ЦентрИдей.ПолучитьПредставлениеПожелания(Пожелание, Пользователь);
	КоличествоЗапросов = РезультатЗапросовПоПожеланием.Количество();
	Пожелания = РезультатЗапросовПоПожеланием.Получить(КоличествоЗапросов - 1).Выгрузить();
	ПредставлениеПожелания.Idea = ПожеланиеXDTO(Пожелания.Получить(0), Истина);
	
	// Заполнение комментариев по пожеланию
	НачальныйЭлемент = НомерСтраницыКомментариев * КоличествоКомментариевНаСтранице - КоличествоКомментариевНаСтранице;
	Итерация = 0;
	
	// Определение количества комментариев для списка
	МаксимальноеЧислоВыбранныхКомментариев = ЦентрИдей.МаксимальноеЧислоВыбранныхКомментариевКПожеланием();
	КоличествоКомментариевВВыборке = КоличествоКомментариевНаСтранице*НомерСтраницыКомментариев + 1; 
	Если КоличествоКомментариевВВыборке > МаксимальноеЧислоВыбранныхКомментариев Тогда 
		КоличествоКомментариевВВыборке = МаксимальноеЧислоВыбранныхКомментариев;
	КонецЕсли;
	
	РезультатЗапросовПоКомментариям = ЦентрИдей.КомментраииПоПожеланию(Пожелание, КоличествоКомментариевВВыборке);
	КомментраииПоПожеланию = РезультатЗапросовПоКомментариям.Получить(1).Выгрузить();
	Для Каждого Комментарий Из КомментраииПоПожеланию Цикл 
		Если Итерация < НачальныйЭлемент Тогда 
			Итерация = Итерация + 1;
			Продолжить;
		КонецЕсли;
		ОбъектКомментария = ЗаполнитьКомментарий(Комментарий.Комментарий);
		ПредставлениеПожелания.CommentsList.Добавить(ОбъектКомментария);
		
		Итерация = Итерация + 1;
	КонецЦикла;
	
	// Заполнение количества комментариев по пожеланию
	Если РезультатЗапросовПоКомментариям.Получить(0).Пустой() Тогда 
		ПредставлениеПожелания.IdeaCommentsCount = 0;
	Иначе
		ПредставлениеПожелания.IdeaCommentsCount = РезультатЗапросовПоКомментариям.Получить(0).Выгрузить().Получить(0).КоличествоКомментариев;
	КонецЕсли;
	
	Возврат ПредставлениеПожелания;
	
КонецФункции

Функция ДобавитьПожелание(СтроковыйИдентификаторПользователя, Содержание, Вложения, ИмяПредмета, Наименование)
	
	УстановитьПривилегированныйРежим(Истина);
	ИдентификаторПользователя = Новый УникальныйИдентификатор(СтроковыйИдентификаторПользователя);
	Пользователь = Справочники.ПользователиСервисов.ПолучитьСсылку(ИдентификаторПользователя);
	Если Пользователь.ПолучитьОбъект() = Неопределено Тогда 
		ТекстИсключения = НСтр("ru = 'Не найден пользователь по идентификатору'");
		ИмяСобытия = ЦентрИдей.ИмяСобытияДляЖурналаРегистрации();
		ЦентрИдей.ЗаписатьОшибкуВЖурнал(ИмяСобытия, ТекстИсключения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	СтруктураВложений = ПривестиВложения(Вложения);
	
	Предмет = ЦентрИдей.ПредметПоНаименованию(ИмяПредмета);
	
	// Добавление нового пожелания
	Пожелание = ЦентрИдей.ДобавитьПожелание(Наименование, Содержание, СтруктураВложений, Предмет, Пользователь, ТекущаяДата());
	
	// Добавление голоса к пожеланию пользователя
	МассивПользователей = Новый Массив;
	МассивПользователей.Добавить(Пользователь);
	ЦентрИдей.ДобавитьГолосаПользователейКПожеланию(МассивПользователей, Пожелание);
	
	Возврат Истина;
	
КонецФункции

Функция ДобавитьГолос(СтроковыйИдентификаторПожелания, СтроковыйИдентификаторПользователя, Голос)
	
	УстановитьПривилегированныйРежим(Истина);
	ИдентификаторПользователя = Новый УникальныйИдентификатор(СтроковыйИдентификаторПользователя);
	Пользователь = Справочники.ПользователиСервисов.ПолучитьСсылку(ИдентификаторПользователя);
	Если Пользователь.ПолучитьОбъект() = Неопределено Тогда 
		ТекстИсключения = НСтр("ru = 'Не найден пользователь по идентификатору'");
		ИмяСобытия = ЦентрИдей.ИмяСобытияДляЖурналаРегистрации();
		ЦентрИдей.ЗаписатьОшибкуВЖурнал(ИмяСобытия, ТекстИсключения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	ИдентификаторПожелания = Новый УникальныйИдентификатор(СтроковыйИдентификаторПожелания);
	Пожелание = Справочники.Пожелания.ПолучитьСсылку(ИдентификаторПожелания);
	Если Пожелание.Пустая() Тогда 
		ТекстИсключения = НСтр("ru = 'Не найдена Пожелание по идентификатору'");
		ИмяСобытия = ЦентрИдей.ИмяСобытияДляЖурналаРегистрации();
		ЦентрИдей.ЗаписатьОшибкуВЖурнал(ИмяСобытия, ТекстИсключения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	МассивПользователей = Новый Массив;
	МассивПользователей.Добавить(Пользователь);
	ЦентрИдей.ДобавитьГолосаПользователейКПожеланию(МассивПользователей, Пожелание, Голос);
	
	Возврат Истина;
	
КонецФункции

Функция ДобавитьКомментарийКПожеланию(СтроковыйИдентификаторПожелания, СтроковыйИдентификаторПользователя, СтроковыйИдентификаторКомментария, ТекстHTML)
	
	УстановитьПривилегированныйРежим(Истина);
	ИдентификаторПользователя = Новый УникальныйИдентификатор(СтроковыйИдентификаторПользователя);
	Пользователь = Справочники.ПользователиСервисов.ПолучитьСсылку(ИдентификаторПользователя);
	Если Пользователь.ПолучитьОбъект() = Неопределено Тогда 
		ТекстИсключения = НСтр("ru = 'Не найден пользователь по идентификатору'");
		ИмяСобытия = ЦентрИдей.ИмяСобытияДляЖурналаРегистрации();
		ЦентрИдей.ЗаписатьОшибкуВЖурнал(ИмяСобытия, ТекстИсключения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	ИдентификаторПожелания = Новый УникальныйИдентификатор(СтроковыйИдентификаторПожелания);
	Пожелание = Справочники.Пожелания.ПолучитьСсылку(ИдентификаторПожелания);
	Если Пожелание.ПолучитьОбъект() = Неопределено Тогда 
		ТекстИсключения = НСтр("ru = 'Не найдено Пожелание по идентификатору'");
		ИмяСобытия = ЦентрИдей.ИмяСобытияДляЖурналаРегистрации();
		ЦентрИдей.ЗаписатьОшибкуВЖурнал(ИмяСобытия, ТекстИсключения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Если Не ПустаяСтрока(СтроковыйИдентификаторКомментария) Тогда 
		ИдентификаторКомментария = Новый УникальныйИдентификатор(СтроковыйИдентификаторКомментария);
		ОсновнойКомментарий = Документы.КомментарийПользователя.ПолучитьСсылку(ИдентификаторКомментария);
	Иначе
		ОсновнойКомментарий = Документы.КомментарийПользователя.ПустаяСсылка();
	КонецЕсли;
	
	ЦентрИдей.ДобавитьКомментрийКПожеланию(Пожелание, Пользователь, ОсновнойКомментарий, ТекстHTML, ТекущаяДата());
	
	Возврат Истина;
	
КонецФункции

Функция НайтиПожелания(ПоисковыйЗапрос, ФильтрПоГруппе, ФильтрыПоПредмету, ТипСортировки, НомерСтраницы, СтроковыйИдентификаторПользователя, КоличествоПожеланийНаСтранице)
	
	УстановитьПривилегированныйРежим(Истина);
	// Оперделение пользователя
	ИдентификаторПользователя = Новый УникальныйИдентификатор(СтроковыйИдентификаторПользователя);
	Пользователь = Справочники.ПользователиСервисов.ПолучитьСсылку(ИдентификаторПользователя);
	Если Пользователь.ПолучитьОбъект() = Неопределено Тогда 
		ТекстИсключения = НСтр("ru = 'Не найден пользователь по идентификатору'");
		ИмяСобытия = ЦентрИдей.ИмяСобытияДляЖурналаРегистрации();
		ЦентрИдей.ЗаписатьОшибкуВЖурнал(ИмяСобытия, ТекстИсключения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	// Определение списка доступных предметов пользователю
	ДоступныеКомпонентыПожеланий = ЦентрИдей.ДоступныеКомпонентыПожеланий(Пользователь);
	Если ДоступныеКомпонентыПожеланий.Количество() = 0 Тогда 
		ТекстИсключения = НСтр("ru = 'Нет доступных предметов идей'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	// Определение фильтров по предмету
	СписокПредметов = ЦентрИдей.ОтфильтрованныеКомпоненты(ДоступныеКомпонентыПожеланий, ФильтрыПоПредмету);
	
	////////////////////////////////////////////////////////////////////////////////
	// Заполнение выходных данных
	ТипКонтейнераСписка = ФабрикаXDTO.Тип(ЦентрИдей.ПространствоИмен_1_0_0_1(), "IdeaListPresentation");
	КонтейнерСписка = ФабрикаXDTO.Создать(ТипКонтейнераСписка);
	
	// Определение количества пожеланий для списка
	МаксимальноеЧислоВыбранныхПожеланий = ЦентрИдей.МаксимальноеЧислоВыбранныхПожеланий();
	КоличествоПожеланийВВыборке = КоличествоПожеланийНаСтранице*НомерСтраницы + 1; // Плюс один делается, чтобы знать: есть ли еще пожелания после или нет.
	Если КоличествоПожеланийВВыборке > МаксимальноеЧислоВыбранныхПожеланий Тогда 
		КоличествоПожеланийВВыборке = МаксимальноеЧислоВыбранныхПожеланий;
	КонецЕсли;
	
	// Заполнение списка пожеланий по пользователю предметов
	РезультатЗапросов = ЦентрИдей.НайтиПожелания(ПоисковыйЗапрос, Пользователь, СписокПредметов, КоличествоПожеланийВВыборке);
	
	КоличествоЗапросов = РезультатЗапросов.Количество();
	
	////////////////////////////////////////////////////////////////////////////////
	// Заполнение выходных данных
	ТипКонтейнераСписка = ФабрикаXDTO.Тип(ЦентрИдей.ПространствоИмен_1_0_0_1(), "IdeaListPresentation");
	КонтейнерСписка = ФабрикаXDTO.Создать(ТипКонтейнераСписка);
	
	// Заполнение списка пожеланий по пользователю
	СписокПожеланий = РезультатЗапросов.Получить(КоличествоЗапросов - 1).Выгрузить();
	НачальныйЭлемент = НомерСтраницы * КоличествоПожеланийНаСтранице - КоличествоПожеланийНаСтранице;
	Итерация = 0;
	Для Каждого ЭлементПожелания Из СписокПожеланий Цикл 
		Если Итерация < НачальныйЭлемент Тогда 
			Итерация = Итерация + 1;
			Продолжить;
		КонецЕсли;
		ПожеланиеXDTO = ПожеланиеXDTO(ЭлементПожелания);
		КонтейнерСписка.IdeasList.Добавить(ПожеланиеXDTO);
		Итерация = Итерация + 1;
	КонецЦикла;
	
	// Заполнение количества пожеланий всего
	НомерЗапроса = КоличествоЗапросов - 4;
	Если РезультатЗапросов.Получить(НомерЗапроса).Пустой() Тогда 
		КонтейнерСписка.IdeasCount = 0;
	Иначе
		КонтейнерСписка.IdeasCount = РезультатЗапросов.Получить(НомерЗапроса).Выгрузить().Получить(0).КоличествоПожеланий;
	КонецЕсли;
	
	// Заполнение доступных предметов
	Для Каждого ДоступныйПредмет Из ДоступныеКомпонентыПожеланий Цикл 
		КонтейнерСписка.SubjectsList.Добавить(ДоступныйПредмет.Наименование);
	КонецЦикла;
	
	Возврат КонтейнерСписка;
	
КонецФункции

Функция УдалитьКомментарийКПожеланию(СтроковыйИдентификаторКомментария)
	
	УстановитьПривилегированныйРежим(Истина);
	ИдентификаторКомментария = Новый УникальныйИдентификатор(СтроковыйИдентификаторКомментария);
	Комментарий = Документы.КомментарийПользователя.ПолучитьСсылку(ИдентификаторКомментария);
	Если Комментарий.Пустая() Тогда 
		ТекстИсключения = НСтр("ru = 'Не найден комментарий'");
		ИмяСобытия = ЦентрИдей.ИмяСобытияДляЖурналаРегистрации();
		ЦентрИдей.ЗаписатьОшибкуВЖурнал(ИмяСобытия, ТекстИсключения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	ЦентрИдей.УдалитьКомментарий(Комментарий);
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция ПожеланиеXDTO(Знач ДанныеПожелания, Знач ЗаполнятьВложения = Ложь)
	
	ТипXDTO = ФабрикаXDTO.Тип(ЦентрИдей.ПространствоИмен_1_0_0_1(), "Idea");
	ОбъектXDTO = ФабрикаXDTO.Создать(ТипXDTO);
    
    СоответствиеПолей = Новый Структура;
    // Поля для подстановки без обработки
    СоответствиеПолей.Вставить("CreateDate", "ДатаРегистрации");
    СоответствиеПолей.Вставить("ClosingDate", "ДатаЗакрытия");
    СоответствиеПолей.Вставить("DeveloperComment", "КомментарийРазработчика");
    СоответствиеПолей.Вставить("Text", "Описание");
    СоответствиеПолей.Вставить("Subject", "КомпонентыСтрока");
    СоответствиеПолей.Вставить("PlanMadeDate", "ПлановаяДатаРеализации");
    // Поля, требующие обработку до подстановки
    СоответствиеПолей.Вставить("Пользователь", "Автор");
    СоответствиеПолей.Вставить("ИмяПользователя", "Автор.Наименование");
    СоответствиеПолей.Вставить("Состояние", "Состояние");
    СоответствиеПолей.Вставить("ПлановаяДатаРеализации", "ПлановаяДатаРеализации");
    СоответствиеПолей.Вставить("УточнениеДатыРеализации", "УточнениеДатыРеализации");
    СоответствиеПолей.Вставить("ОписаниеХранилище", "ОписаниеХранилище");
    
    ЗначенияПолей = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеПожелания.Пожелание, СоответствиеПолей);
    ЗаполнитьЗначенияСвойств(ОбъектXDTO, ЗначенияПолей);
    
    Описание = ЗначенияПолей.ОписаниеХранилище.Получить();
    ВложенияПожелания = Новый Структура;
    ТекстHTML = "";
    Если ТипЗнч(Описание) = Тип("ФорматированныйДокумент") Тогда
        Описание.ПолучитьHTML(ТекстHTML, ВложенияПожелания);
    КонецЕсли;
    	
	ОбъектXDTO.Id = Строка(ДанныеПожелания.Пожелание.УникальныйИдентификатор());
	ОбъектXDTO.Name = ЦентрИдей.ПредставлениеПожелания(ДанныеПожелания.Пожелание);
	ОбъектXDTO.UserId = Строка(ЗначенияПолей.Пользователь.УникальныйИдентификатор());;
	ОбъектXDTO.UserName = ?(ТипЗнч(ЗначенияПолей.ИмяПользователя) = Тип("Строка"), ЗначенияПолей.ИмяПользователя, "");
	ОбъектXDTO.CommentsCount = ДанныеПожелания.КоличествоКомментариев;
	ОбъектXDTO.HTMLText = ТекстHTML;
	ОбъектXDTO.Status = ПолучитьСтатусXDTO(ЗначенияПолей.Состояние);
	ОбъектXDTO.PlanMadeDatePresentation = ЦентрИдей.ПредставлениеДатыРеализации(ЗначенияПолей.ПлановаяДатаРеализации, ЗначенияПолей.УточнениеДатыРеализации);
	ОбъектXDTO.PositiveVotesSum = ДанныеПожелания.СуммаПоложительныхГолосов;
	ОбъектXDTO.NegativeVotesSum = ДанныеПожелания.СуммаОтрицательныхГолосов;
	ОбъектXDTO.Vote = ДанныеПожелания.ГолосПользователя;
	ОбъектXDTO.Rating = ДанныеПожелания.Рейтинг;
	
	Если ЗаполнятьВложения Тогда 
		Для Каждого Вложение Из ВложенияПожелания Цикл 
            
            Попытка
			    ДанныеВложения = Вложение.Значение.ПолучитьДвоичныеДанные();
            Исключение
				Продолжить;
			КонецПопытки;
			
			ТипВложения = ФабрикаXDTO.Тип(ЦентрИдей.ПространствоИмен_1_0_0_1(), "Attachment");
			ОбъектВложения = ФабрикаXDTO.Создать(ТипВложения);
			ОбъектВложения.Name = Вложение.Ключ;
			ОбъектВложения.Data = ДанныеВложения;
			
			ОбъектXDTO.Attachments.Добавить(ОбъектВложения);
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат ОбъектXDTO;
	
КонецФункции

Функция ЗаполнитьКомментарий(Знач Комментарий)
	
	ТипКомментария = ФабрикаXDTO.Тип(ЦентрИдей.ПространствоИмен_1_0_0_1(), "IdeaComment");
	ОбъектКомментария = ФабрикаXDTO.Создать(ТипКомментария);
    
    СоответствиеПолей = Новый Структура;
    СоответствиеПолей.Вставить("Date", "Дата");
    СоответствиеПолей.Вставить("Text", "Описание");
    СоответствиеПолей.Вставить("UserName", "Автор.Наименование");
    СоответствиеПолей.Вставить("ОсновнойКомментарий", "ВзаимодействиеОснование");
    СоответствиеПолей.Вставить("Автор", "Автор");
    СоответствиеПолей.Вставить("Входящий", "Входящий");
    
    ЗначенияПолей = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Комментарий, СоответствиеПолей);
    ЗаполнитьЗначенияСвойств(ОбъектКомментария, ЗначенияПолей);
    
    ОбъектКомментария.IsSupport = Не ЗначенияПолей.Входящий;
	ОбъектКомментария.UserId = Строка(ЗначенияПолей.Автор.УникальныйИдентификатор());
	ОбъектКомментария.Id = Строка(Комментарий.УникальныйИдентификатор());
	Если ЗначениеЗаполнено(ЗначенияПолей.ОсновнойКомментарий) И ТипЗнч(ЗначенияПолей.ОсновнойКомментарий) = Тип("ДокументСсылка.КомментарийПользователя") Тогда 
		ОбъектКомментария.MainIdeaComment = ЗаполнитьКомментарий(ЗначенияПолей.ОсновнойКомментарий);
	Иначе
		ОбъектКомментария.MainIdeaComment = Неопределено;
	КонецЕсли;
	
	Возврат ОбъектКомментария;
	
КонецФункции

Функция ПривестиВложения(Знач Вложения)
	
	СтруктрураВложнеий = Новый Структура;
	Для Каждого Вложение Из Вложения.AttachmentElement Цикл 
		СтруктрураВложнеий.Вставить(Вложение.Name, Вложение.Data);
	КонецЦикла;
	
	Возврат СтруктрураВложнеий;
	
КонецФункции

Функция ПолучитьСтатусXDTO(Знач Статус)
	
	Если Статус = Перечисления.СостоянияПожеланий.Запланировано Тогда 
		Возврат "plan";
	ИначеЕсли Статус = Перечисления.СостоянияПожеланий.НаГолосовании Тогда 
		Возврат "voiting";
	ИначеЕсли Статус = Перечисления.СостоянияПожеланий.Отклонено Тогда 
		Возврат "deviation";
	ИначеЕсли Статус = Перечисления.СостоянияПожеланий.Реализовано Тогда 
		Возврат "realization";
	ИначеЕсли Статус = Перечисления.СостоянияПожеланий.Рассматривается Тогда 
		Возврат "consideration";
	КонецЕсли;
	
КонецФункции

#КонецОбласти
